import re
text = """Жирафи люблять носити різні
__СУЩЕСТВИТЕЛЬНОЕ В МНОЖИНІ__ цілий день. Жирафи також
славляться тим, що їдять красиві __СУЩЕСТВИТЕЛЬНОЕ В МНОЖИНІ__, але
після цього у них часто , болит __ЧАСТЬ_ТЕЛА__. Якщо всеж
таки жирафа находить __ЧИСЛО__ __СУЩЕСТВИТЕЛЬНОЕ В МНОЖИНІ__, у них
миттєво відвалюється __ЧАСТЬ_ТЕЛА__.
"""
def mad_libs(mls):
    """
:param mls: В рядках користувацький ввід
повинен бути з двойними підкресленнями.
Підкреслення неможна вставляти в підказку:
__підказка_підказка__ (неможна);
__підказка__ (можна).
"""
    hints = re.findall("__.*?__", mls)
    if hints is not None:
        for word in hints:
            q = "Введіть {}".format(word)
            new = input(q)
            mls = mls.replace(word,new,1)
        print ('\n')
        mis = mls.replace("\n","")
        print(mls)
    else: print("Помилка вводу")
mad_libs(text)
